'''
列表练习
    练习一：
        1，创建一个10个元素的列表，值是[30,31,30,31...]
        2，将下标为0的元素剔除
        3，将下标为1的元素改为28
        4，将下标为7的元素插入一个元素 31
        5，在列表末尾追加两个元素：30，31
        最终列表应该是[31,28,31,30,31,30,31,31,30,31,30,31]
    
    练习二：
        1，提示用户输入一个1-12之间的数字，根据数字在控制台显示这个月有多少天
        例如 7， 就显示"7月份有 31 天"
'''
#练习一
#value = [30,31,30,31,30,31,30,31,30,31]
l=[30,31]
value = l*5
value.pop(0)
value[1]=28
value.insert(6,31)
#value.append(30)
#value.append(31)
value.extend([30,31])
print(value)

#练习二
month = input("请输入一个1~12的数字")
days = [
    [1,31],
    [2,28],
    [3,31],
    [4,30],
    [5,31],
    [6,30],
    [7,31],
    [8,31],
    [9,30],
    [10,31],
    [11,30],
    [12,31]
]
print(f'{month}月一共有 {days[int(month)-1][1]} 天!!!')

a = int(month)
if a <= 6 and a !=2:
    if a % 2 == 0:
        day = 30
    else:
        day =31
elif a == 2:
    day = 28
else:
    if a % 2 == 1:
        day = 30
    else:
        day =31
print(f'{a}月一共有 {day} 天!!!')